app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'reren@gmail.com'
 LIMIT 1
---
    public function loginPost()
    {
        $session = session();
        $model = new UserModel();

        $email = $this->request->getPost('username'); // bisa juga diganti ke "email"
        $password = $this->request->getPost('password');

        $user = $model->where('email', $email)->first();